УТ_для_edt.РасширениеСмарт/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ВариантыОбеспечения/Forms/ВыборВариантаОбеспечения/Module.bsl
#Область ПеренесеноСДоработками

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Элементы.Обеспечивать.Доступность = Не Параметры.ТолькоОбособленно;

	ЗаполнитьСписокДоступныхВариантовОбеспечения();

	#Вставка
	//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
	// Фролов+
	Если Параметры.Свойство("УдалитьКОбеспечению",Истина) Тогда 
		СписокВариантов.Удалить(СписокВариантов.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.Требуется));
	КонецЕсли;	
	// Фролов-
	//-- смарт:ММ 27.03.2020
	#КонецВставки

	СтрокаОбособлена = Параметры.ТекущийВариант.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Обособленно")
	Или Параметры.ТекущийВариант.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно");

	КоличествоОтгружено = Параметры.КоличествоОформлено;
	КоличествоТребуется = Параметры.ТекущийВариант.Количество - КоличествоОтгружено;

	ФорматЧислоНоль = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (Все)'"),
	Формат(КоличествоТребуется, "ЧДЦ=3; ЧН=0.000"));
	Элементы.Количество.Формат = "ЧН=" + "'" + ФорматЧислоНоль + "'";
	Элементы.КоличествоОбособленно.Формат = "ЧН=" + "'" + ФорматЧислоНоль + "'";

	Если Не ЗначениеЗаполнено(Упаковка) Тогда
		ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Отбор.Номенклатура, "ЕдиницаИзмерения");
		ПредставлениеЕдиницыИзмерения = Строка(ЕдиницаИзмерения);
	Иначе
		ПредставлениеЕдиницыИзмерения = Строка(Упаковка);
	КонецЕсли;

	// Заполнение таблицы отборов по параметрам, переданным в форму.
	Отбор = ТаблицаАналитикиПотребности(Параметры);

	// Корректировочная таблица календаря обеспечения.
	Корректировка = ПолучитьИзВременногоХранилища(Параметры.АдресКорректировки);
	УдалитьИзВременногоХранилища(Параметры.АдресКорректировки);

	ДоступныеОстатки = ОбеспечениеСервер.ДоступныеОстатки(Отбор, Корректировка);
	ПлановыеПоставки = ОбеспечениеСервер.ПлановыеПоставки(Отбор);

	#Вставка
	//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
	смартЗапчастиГарантийные = Параметры.Свойство("смартЗапчастиГарантийные") И Параметры.смартЗапчастиГарантийные;
	
	ОбеспечениеСервер.смартСкорректироватьТаблицуОстатковПоПризнакуГарантийныхТоваров(ДоступныеОстатки.Товары, смартЗапчастиГарантийные);
	ОбеспечениеСервер.смартСкорректироватьТаблицуОстатковПоПризнакуГарантийныхТоваров(ДоступныеОстатки.Работы, смартЗапчастиГарантийные);
	ОбеспечениеСервер.смартСкорректироватьТаблицуОстатковПоПризнакуГарантийныхТоваров(ДоступныеОстатки.ТоварыОбособленные, смартЗапчастиГарантийные);
	//-- #Б1448 смарт: Шляпников 28.11.2024
	#КонецВставки
	
	ТипНоменклатуры = Параметры.Отбор.ТипНоменклатуры;
	КоличествоОтгрузитьОбособленно = 0;
	ОбеспечениеСверхДопустимо = ПолучитьФункциональнуюОпцию("РазрешитьОбособлениеТоваровСверхПотребности");
	Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга И КоличествоТребуется > 0 Тогда

		ЗагрузитьДействияУслуг(СписокВариантов, Действия);

	ИначеЕсли КоличествоТребуется > 0 Тогда

		// Заполнение обособленных действий
		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда

			КоличествоПодНазначение = ЗагрузитьДействияРабот(СписокВариантов,
			ДействияОбособленные, ДоступныеОстатки.Работы, КоличествоТребуется);

			ЗагрузитьПлановыеПоставки(СписокВариантов,
			ДействияОбособленные, ПлановыеПоставки, Перечисления.ВариантыОбеспечения.Обособленно);

		ИначеЕсли ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда

			Если Параметры.ОтгружатьЕслиПоступилоПодНазначениеПолностью Тогда
				ЭлементОтгрузить = СписокВариантов.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно);
				Если ЭлементОтгрузить <> Неопределено 
					И ДоступныеОстатки.ТоварыОбособленные.Итог("Количество") < КоличествоТребуется Тогда
					СписокВариантов.Удалить(ЭлементОтгрузить);
				КонецЕсли;
			КонецЕсли;

			КоличествоПодНазначение = ЗагрузитьДействияОбособленные(СписокВариантов,
			ДействияОбособленные, ДоступныеОстатки.ТоварыОбособленные, КоличествоОтгрузитьОбособленно);

			Если НЕ Параметры.ОтгружатьЕслиПоступилоПодНазначениеПолностью
				ИЛИ КоличествоОтгружено = 0 Тогда

				ЗагрузитьПлановыеПоставки(СписокВариантов,
				ДействияОбособленные, ПлановыеПоставки, Перечисления.ВариантыОбеспечения.Обособленно);

			КонецЕсли; 

		Иначе
			КоличествоПодНазначение = 0;
		КонецЕсли;

		// Заполнение необособленных действий
		Если КоличествоПодНазначение < КоличествоТребуется Или ОбеспечениеСверхДопустимо Тогда

			Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда

				Если СписокВариантов.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.Отгрузить) <> Неопределено Тогда
					НоваяСтрока = Действия.Добавить();
					НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
					НоваяСтрока.Количество = КоличествоТребуется - КоличествоПодНазначение;
				КонецЕсли;

			Иначе

				ЗагрузитьДействия(СписокВариантов, Действия, ДоступныеОстатки.Товары);

			КонецЕсли;

			ЗагрузитьПлановыеПоставки(СписокВариантов, Действия, ПлановыеПоставки, Перечисления.ВариантыОбеспечения.Требуется);

			Если КоличествоПодНазначение > 0 И Не ОбеспечениеСверхДопустимо Тогда
				Для Каждого Строка Из Действия Цикл
					Если Строка.Количество = 0 Или Строка.Количество > КоличествоТребуется - КоличествоПодНазначение Тогда
						Строка.КоличествоДоступно = Строка.Количество;
						Строка.Количество = КоличествоТребуется - КоличествоПодНазначение;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;

			Если СписокВариантов.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.НеТребуется) <> Неопределено Тогда

				НоваяСтрока = Действия.Добавить();
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;
				НоваяСтрока.Количество = КоличествоТребуется - ?(ОбеспечениеСверхДопустимо, 0, КоличествоПодНазначение);

				НоваяСтрока.Склад = Параметры.ТекущийВариант.Склад;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Если СтрокаОбособлена Или (КоличествоПодНазначение > 0 И Не ОбеспечениеСверхДопустимо) Тогда

		ВариантПоУмолчанию = Перечисления.ВариантыОбеспечения.Обособленно;

	ИначеЕсли СписокВариантов.НайтиПоЗначению(Перечисления.ВариантыОбеспечения.Требуется) <> Неопределено Тогда

		ВариантПоУмолчанию = Перечисления.ВариантыОбеспечения.Требуется;

	Иначе

		ВариантПоУмолчанию = Перечисления.ВариантыОбеспечения.НеТребуется;

	КонецЕсли;

	ТекущийВариант = Параметры.ТекущийВариант;
	ИсходнаяСтрокаОбособлена = ТекущийВариант.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно
	Или ТекущийВариант.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно;

	Таблица = ?(ИсходнаяСтрокаОбособлена, ДействияОбособленные, Действия);
	ИдентификаторСтроки = НайтиИдентификаторСтроки(Таблица, ТекущийВариант.ВариантОбеспечения, ТекущийВариант.ДатаДоступности);
	Если ИдентификаторСтроки = Неопределено И Таблица.Количество() > 0 Тогда
		ИдентификаторСтроки = Таблица[0].ПолучитьИдентификатор();
	КонецЕсли;

	Для Каждого Строка Из Действия Цикл
		ОформитьСтроку(Строка, КоличествоТребуется, СписокВариантов);
	КонецЦикла;

	Для Каждого Строка Из ДействияОбособленные Цикл
		ОформитьСтроку(Строка, КоличествоТребуется, СписокВариантов);
	КонецЦикла;

	Действия.Сортировать("ПорядокСортировки, ДатаДоступности, Склад");
	ДействияОбособленные.Сортировать("ПорядокСортировки, ДатаДоступности, Склад");

	ТаблицаФормы = Элементы[?(ИсходнаяСтрокаОбособлена, "ДействияОбособленные", "Действия")];
	ТаблицаФормы.ТекущаяСтрока = ИдентификаторСтроки;

	Обеспечивать = ?(ИсходнаяСтрокаОбособлена Или КоличествоПодНазначение > 0,
	НСтр("ru = 'Обособленно'"), НСтр("ru = 'Не обособленно'"));

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбособленноеОбеспечениеЗаказов") Тогда
		Элементы.Обеспечивать.Видимость = Ложь;
	ИначеЕсли ДействияОбособленные.Количество() = 0 Тогда
		Элементы.Обеспечивать.Доступность = Ложь;
	КонецЕсли;

	Если КоличествоПодНазначение >= КоличествоТребуется И Не ОбеспечениеСверхДопустимо Тогда
		Элементы.Обеспечивать.Доступность = Ложь;
	КонецЕсли;

	СкладВидимость = Справочники.Склады.ЭтоГруппа(Параметры.ГруппаСкладов);
	Элементы.Склад.Видимость = СкладВидимость;
	Элементы.СкладОбособленно.Видимость = СкладВидимость;

	Элементы.СтраницыДействия.ТекущаяСтраница = ?(Обеспечивать = "Обособленно",
	Элементы.СтраницаДействияОбособленные, Элементы.СтраницаДействия);

	ХарактеристикаТекст = ?(ЗначениеЗаполнено(Параметры.Отбор.Характеристика), ", " + Параметры.Отбор.Характеристика, "");
	ШаблонЗаголовка = НСтр("ru = 'Выбор действия (%1%2)'");
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка,
	Параметры.Отбор.Номенклатура, ХарактеристикаТекст);

	Элементы.НадписьЗаказаноОтгружено.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Всего заказано - %1 %2. Отгружено - %3 %4.'"),
	КоличествоТребуется + КоличествоОтгружено, ЕдиницаИзмерения,
	КоличествоОтгружено, ЕдиницаИзмерения);


	Если КоличествоТребуется <= 0 Тогда
		Элементы.ГруппаВыбранноеДействие.Видимость = Ложь;
		Элементы.Выбрать.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт


#КонецОбласти
